[
    {
        "titre": "MNTN",
        "badges":["HTML", "CSS"],
        "contDesc":"MNTN est une entreprise spécialisée dans les activités de plein air et le tourisme. Elle propose du matériel ainsi que des conseils et des ressources pour les randonneurs confirmés où non.",
        "adresse":"http://adresse-fictive.com",
        "objDesc":{
            "obj1":"Utilisation correcte des balises sémantiques.",
            "obj2":"Qualité générale de la structure HTML.",
            "obj3":"Nommage des sélecteurs et qualité générale du CSS.",
            "obj4":"Utilisation des positionnements (static, fixed, relative , absolute)."
        },
        "photos":{
            "img1":"mntn/mntn_hero.png",
            "img2":"mntn/mntn_section.png",
            "img3":"mntn/mntn_section_bis.png",
            "img4":"mntn/mntn_footer.png"
        }
    },
    {
        "titre": "4 Elements",
        "badges":["HTML", "CSS"],
        "contDesc":"4 Éléments propose des hôtels insolites intégrés à des environnements naturels, ciblant les couples CSP+ sans enfant, avec un site web élégant permettant des réservations en ligne ou par téléphone, incluant des animations au survol en accord avec leur esthétique.",
        "adresse":"http://adresse-fictive.com",
        "objDesc":{
            "obj1":"Effectuer une analyse du cahier des charges, du design system et des maquettes fournis. ",
            "obj2":"Intégrer la page d'accueil du site ainsi que la page de l'hôtel \"Feu\" en ayant préalablement schématisé leur structure.",
            "obj3":"Ces pages ont dû être optimisées pour une expérience responsive maximale.",
            "obj4":"Renseigner tous les éléments nécessaires au référencement tels que le titre, la méta-description, le titre des liens et l'attribut \"alt\" des images."
        },
        "photos":{
            "img1":"4elements/projets_4_elements.png",
            "img2":"4elements/projets_4_elements_createur.png",
            "img3":"4elements/projets_4_elements_hotelfeu.png",
            "img4":"4elements/projets_4_elements_servicessupp.png"
        }
    },

    {
        "titre": "Dehors!",
        "badges":["HTML", "CSS", "JS"],
        "contDesc":"\"Dehors! Escape Game Paris\" est une entreprise proposant des jeux d'évasion en extérieur à Paris. Le site vise à promouvoir leurs activitées en fournissant des informations sur les expériences proposées, les thèmes des jeux ou encore les avantages de participer",
        "adresse":"http://adresse-fictive.com",
        "objDesc":{
            "obj1":"Utilisation d'un fichier JSON pour générer certains contenus dynamiquement (appel AJAX avec \"fetch()\")",
            "obj2":"Utilisation de la sémantique et des attributs pour l'accessibilité et le référencement",
            "obj3":"Optimisation de la page pour le responsive",
            "obj4":"Respect de l'aspect général de la maquette"
        },
        "photos":{
            "img1":"Dehors!/dehors_cards.png",
            "img2":"Dehors!/dehors_mid.png",
            "img3":"Dehors!/dehors_cards.png",
            "img4":"Dehors!/dehors_mid.png"
        }
    },

    {
        "titre": "M'S",
        "badges": ["HTML", "CSS", "JS"],
        "contDesc":"M'S (Men Sportswear) est une boutique spécialisée dans les équipements de sports pour hommes. Leur demande: l'intégration selon la maquette fournie de la page d’accueil, un template de page d’une catégorie “chaussures-baskets”, ainsi qu’un template de page détail produit.",
        "adresse":"http://adresse-fictive.com",
        "objDesc":{
            "obj1":"Utilisation des connaissances sur le référencement naturel pour que le site soit rapidement trouvé dans les moteurs de recherche",
            "obj2":"Validation des données saisies dans le formulaire de contact",
            "obj3":"Affichage dynamique de la page \"catégories baskets\" via un fichier JSON",
            "obj4":"Proposition d'animations au designer pour donner du dynamisme aux pages tout en respectant l'identité de la marque"
        },
        "photos":{
            "img1":"Mens_sportswear/MS_hero.PNG",
            "img2":"Mens_sportswear/MS_article.png",
            "img3":"Mens_sportswear/MS_baskets.PNG",
            "img4":"Mens_sportswear/MS_footer.PNG"
        }
    },

    {
        "titre": "Mamma Mia Pizza",
        "badges": ["HTML", "CSS", "JS", "PHP"],
        "contDesc":"Implémentation d'une page permettant à l'utilisateur d'élaborer la composition de sa pizza (pâte, base, taille, ingrédients) sur un site, déjà existant, de commande de pizza en ligne. Cette page inclue l'élaboration étape par étape, le récapitulatif de la pizza avec le détail des ingrédients sélectionnés et la possssibilité de changement à tout moment.",
        "adresse":"http://adresse-fictive.com",
        "objDesc":{
            "obj1":"Conception/modelisation du modèle de données et construction de la base de données",
            "obj2":"Utilisation de requête AJAX pour l'élaboration en temps réel et le récapitulatif de la pizza en cours d'élaboration",
            "obj3":"Gestion de la session et des droits",
            "obj4":"Utilisation de la programmation orientée objet"
        },
        "photos":{
            "img1":"",
            "img2":"",
            "img3":"",
            "img4":""
        }
    }
]